Ran Plan for project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_instance_profile.codebuild_deployment will be created
+ resource "aws_iam_instance_profile" "codebuild_deployment" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "codebuild-deployment-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "codebuild-deployment"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.assume_id_admin will be created
+ resource "aws_iam_role" "assume_id_admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::066346343248:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "assume-id-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codebuild_deployment will be created
+ resource "aws_iam_role" "codebuild_deployment" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-deployment"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.assume_id_admin_passrole will be created
+ resource "aws_iam_role_policy" "assume_id_admin_passrole" {
      + id          = (known after apply)
      + name        = "assume-id-admin-passrole"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_cloudwatch will be created
+ resource "aws_iam_role_policy" "codebuild_deployment_cloudwatch" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:066346343248:log-group:/aws/codebuild/*:*",
                          + "arn:aws:logs:*:066346343248:log-group:/aws/codebuild/*",
                          + "arn:aws:logs:*:066346343248:log-group:/*:*:*",
                          + "arn:aws:logs:*:066346343248:log-group:/*:*",
                          + "arn:aws:logs:*:066346343248:log-group:/*",
                          + "arn:aws:logs:*:066346343248:log-group:*:*:*/*",
                        ]
                      + Sid      = "AllowCloudWatchAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_ecr will be created
+ resource "aws_iam_role_policy" "codebuild_deployment_ecr" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                  + {
                      + Action   = [
                          + "sts:GetServiceBearerToken",
                          + "ecr:GetAuthorizationToken",
                          + "ecr-public:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_kms will be created
+ resource "aws_iam_role_policy" "codebuild_deployment_kms" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-kms-decryption"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ap-northeast-2:066346343248:key/79e6d15d-a3b1-431a-a6a2-ae9c63c25ddb"
                      + Sid      = "AllowToDecryptKMSKey"
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ap-northeast-2:066346343248:parameter/CodeBuild/*"
                      + Sid      = "AllowSsmParameterAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_operation will be created
+ resource "aws_iam_role_policy" "codebuild_deployment_operation" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-operation-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:SendCommand",
                          + "ssm:ListCommandInvocations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SSMSendCommand"
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudwatchAccess"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentELBAccess"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentIAMAccess"
                    },
                  + {
                      + Action   = "ec2:CreateNetworkInterfacePermission"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ap-northeast-2:066346343248:network-interface/*"
                    },
                  + {
                      + Action   = [
                          + "ec2:ModifyLaunchTemplate",
                          + "ec2:GetLaunchTemplateData",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DeleteLaunchTemplateVersions",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:CreateLaunchTemplateVersion",
                          + "ec2:CreateLaunchTemplate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "LaunchTemplates"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeDhcpOptions",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentVPCAccess"
                    },
                  + {
                      + Action   = "autoscaling:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentASGAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVolume*",
                          + "ec2:DeleteVolume",
                          + "ec2:CreateVolume",
                          + "ec2:AttachVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentVolumeAccess"
                    },
                  + {
                      + Action   = "ec2:DescribeKeyPairs"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentKeyPairAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:TerminateInstances",
                          + "ec2:StopInstances",
                          + "ec2:StartInstances",
                          + "ec2:RunInstances",
                          + "ec2:RebootInstances",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentInstanceAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeSnapshots",
                          + "ec2:CreateSnapshot",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentSnapshotAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:RegisterImage",
                          + "ec2:DescribeImages",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentAMIAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentSecurityGroupAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.assume_id_admin will be created
+ resource "aws_iam_role_policy_attachment" "assume_id_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ codebuild_deployment_arn              = (known after apply)
+ codebuild_deployment_instance_profile = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/zerone-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fiam%252Fzerone-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/zerone-id`
</details>
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
